#!/usr/bin/env python
# coding: utf-8

# In[10]:


import numpy as np
x1 = np.array([1, 2, 3, 4, 5])
x2 = np.array([2, 1, 0, -1, -2])
def a(x):
    y = np.zeros_like(x)
    for n in range(2, len(x)):
        y[n] = 0.5 * x[n-1] + x[n-2]
    return y[2:]
def b(x):
    return 5 * x + 3 * x**2

y1_a=a(x1)
y2_a=a(x2)
y1_b=b(x1)
y2_b=b(x2)
print("a:")
print("x1(n):", y1_a)
print("x2(n):", y2_a)
print("\nb:")
print("x1(n):", y1_b)
print("x2(n):", y2_b)


# In[ ]:





# In[ ]:

Για το σύστημα (a):

Αιτιατότητα: Αφού χρησιμοποιούμε προηγούμενες τιμές της εισόδου, το σύστημα είναι αιτιατό.
Χρονικά αμετάβλητο: Το σύστημα δεν είναι χρονικά αμετάβλητο, καθώς οι εξόδοι εξαρτώνται από συγκεκριμένες χρονικές στιγμές της εισόδου.
Γραμμικότητα: Το σύστημα είναι γραμμικό.
Για το σύστημα (b):

Αιτιατότητα: Δεν υπάρχουν προηγούμενες τιμές εισόδου, οπότε το σύστημα είναι αιτιατό.
Χρονικά αμετάβλητο: Το σύστημα είναι χρονικά αμετάβλητο, καθώς οι εξόδοι δεν εξαρτώνται από συγκεκριμένες χρονικές στιγμές της εισόδου.
Γραμμικότητα: Το σύστημα δεν είναι γραμμικό, καθώς περιέχει τον όρο 

 x^2(n) που το καθιστά μη γραμμικό.


